{
    "recent_events": [
 {
  "title": "J.J.P. Dehigama Memorial Orienteering Challenge 2025",
  "description": "Honoring the spirit of adventure and precision, the J.J.P. Dehigama Memorial Orienteering Challenge 2025 marked a thrilling day of navigation, teamwork, and determination. Scouts from across the island showcased their skills and sportsmanship in this memorable annual event.",
  "image": "https://i.imgur.com/KoyDjub.jpeg",
"link": "https://www.facebook.com/J.J.P.DehigamaMOC/posts/pfbid02SQp4FbB7kpZy49tnD3moWL7ws8t7KPTrZfz7hkvJZyrAB4twUfBUGLA1TtHivmnRl"
},
         {
  "title": "Best Explorer - 23rd Sampath Ranawaka Memorial Challenge Trophy 2025",
  "description": "Congratulations to  Council Chairman & Group Leader Master Sithum Devagiri for winning the Best Explorer Award at the 23rd Sampath Ranawaka All-Island Hiking Competition, organized by the Maliyadeva Scout Group.Warmest wishes and heartfelt congratulations from the Kingswood Scout Group!23වන සම්පත් රණවක සමස්ත ලංකා ගවේශණ තරගාවලියේ විශිෂ්ටතම ගවේශකයා ප්‍රදානය දිනාගැනීමට සමූහ සභාපති සිතුම් දේවගිරි සමත්විය. ඔහුට අප සමූහයේ උණුසුම් සුභ පැතුම්",
  "image": "https://i.imgur.com/ODTsqfO.jpeg"
},
              {
  "title": "වෙසක් මල් දන්සල 2025",
  "description": "12/05/2025 දින 2වන මහනුවර කිංස්වුඩ් බාලදක්ෂ සමූහයේ බාලදක්ෂයන් විසින් සංවිධානය කරනු ලැබූ වෙසක් මල් දන්සල,ගැටඹේ රාජෝපවනාරාමය විහාරය ඉදිරිපිටදී සාර්ථකව පවත්වන ලදි. මෙම පුණ්‍ය කර්මය සදහා නන් අයුරින් දායක වූ සියලූම දෙනාට සහ දන්සල සදහා සහභාගී වූ සියලූම දෙනාට සමූහයේ බාලදක්ෂයන් ස්තූතිවන්ත වෙමු... ⚜",
  "image": "https://i.imgur.com/YQhRUXO.jpeg",
   "link": "https://www.facebook.com/share/16KcMuhfLB/"
},
                 {
  "title": "First Aid Service -  Sacred Tooth Relic Veneration 2025",
  "description": "Honored to serve as a Kingswood Scout during the Sacred Tooth Relic veneration. Grateful for the opportunity to provide first aid and be part of this meaningful service.ශ්‍රී දළදා වන්දනාව 2025 ප්‍රථමාධාර සේවය#KFE#KSFE❤️💙⚜️",
  "image": "https://i.imgur.com/gl9wKno.jpeg",
   "link": "https://www.facebook.com/share/p/12HgPwiVnef/"
},
        {
            "title": "Championship at Sqdn.Ldr.Manoj Weerakotuwa Memorial Challenge Trophy 2024",
            "description": "Congratulations! 🏆⚜️ We proudly inform you that Kingswood College Scout Group emerged the Championship at Sqn.Ldr.Manoj Weerakotuwa Memorial Challenge Trophy 2024, which was organized by the 5th Kandy Vidyartha Scout Group Kandy. The winning team is as follows: W.A.G Ranidhu Vojitha, B.M.U Wickramasinghe, A.M.I.T.B Rathnayake, D.N Ranasinghe, U.G.C.I Ranaweera, J.C.R.B Godagedara, D.M.S.P Dewagiri, T.W.S.D Waduge ❤️💙 #kingswoodscouts #kingswoodcollege #srilankascouts #kfe",
            "image": "https://i.imgur.com/krysLqe.jpeg"
        },
        {
            "title": "10th National Scout Jamboree 2024",
            "description": "Kingswood Scouts gathered in front of their ingenious campsite entrance, fashioned after a buzzing beehive. Their teamwork and creativity are the nectar that sweetens the 10th National Scout Jamboree 2024 experience in Trincomalee, Sri Lanka.",
            "image": "https://i.imgur.com/lzF0EH1.jpeg"
        },
        {
            "title": "110 Years of Kingswood Scouting",
            "description": "Celebrating legacy. We honor the enduring legacy of Kingswood Scouts, a tradition built on courage, dedication, and the values that shape future leaders in every way.",
            "image": "images/header-background.jpg"
        },
        {
            "title": "Congratulations to the newly awarded President’s Scouts of the 2nd Kandy Kingswood Scout Group!⚜",
            "description": "Your dedication and hard work have brought you this esteemed recognition, and we couldn’t be prouder. Special congratulations to, •Master Ranidhu Vojitha.•Master Minindu Udantha.•Master Ravidu Himantha.•Master Sanuda Visal.Your achievements inspire us all—keep reaching for greatness! ",
            "image": "https://i.imgur.com/OGOLXiI.png"
        }
    ]
}
